src/InformationRegisters/СтатусыВерсийХранилища/СтатусыВерсийХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыВерсийХранилища</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИсторииХранилищ</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>Процесс</name>
    <type>
      <types>BusinessProcessRef.ПредварительнаяПроверка</types>
      <types>BusinessProcessRef.СогласованиеПереноса</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВерсияХранилища</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗаписиУниверсальная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтатусыВерсийХранилищаСлужебный/СтатусыВерсийХранилищаСлужебный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыВерсийХранилищаСлужебный</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИсторииХранилищ</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>Процесс</name>
    <type>
      <types>BusinessProcessRef.ПредварительнаяПроверка</types>
      <types>BusinessProcessRef.СогласованиеПереноса</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВерсияХранилища</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтатусыВерсийХранилища/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	Для Каждого Запись Из ЭтотОбъект Цикл
		Период = '00010101' + Запись.ДатаЗаписиУниверсальная / 1000;
		СлужебныйНабор = РегистрыСведений.СтатусыВерсийХранилищаСлужебный.СоздатьНаборЗаписей();
		СлужебныйНабор.Отбор.ВерсияХранилища.Установить(Запись.ВерсияХранилища);
		СлужебныйНабор.Отбор.Период.Установить(Период);
		СлужебнаяСтрока = СлужебныйНабор.Добавить();
		ЗаполнитьЗначенияСвойств(СлужебнаяСтрока, Запись);
		СлужебнаяСтрока.Период = Период;
		СлужебныйНабор.Записать();
	КонецЦикла;
	Если ЭтотОбъект.Количество() = 0 И Отбор.ДатаЗаписиУниверсальная.Использование И Отбор.ВерсияХранилища.Использование Тогда
		Период = '00010101' + Отбор.ДатаЗаписиУниверсальная.Значение / 1000;
		СлужебныйНабор = РегистрыСведений.СтатусыВерсийХранилищаСлужебный.СоздатьНаборЗаписей();
		СлужебныйНабор.Отбор.ВерсияХранилища.Установить(Отбор.ВерсияХранилища.Значение);
		СлужебныйНабор.Отбор.Период.Установить(Период);
		СлужебныйНабор.Записать();
	КонецЕсли;
КонецПроцедуры
